<template>
    <div>
        <span style="font-size:24px;"><b>&nbsp;实时Web系统</b></span>
      <div style="font-size:16px;">
        
      <p >某实时的Web系统，服务器端应用程序需要接受客户端发送的不同类型的数据包，为了使系统设计达到最优，使用统一接口，接口（通用包）描述为：</p>
       <p> 接口包的类型：正常交易包、查询包、退货包、换货包、部分退货包、部分换货包；</p>
<p>涉及的商品种类：1、2、3、4、5、6；</p>
<p>支付类型：系统账户余额支付、货到付款、工行账户支付、农行账户支付、建行账户支付、交行账户支付、邮储账户支付、礼品卡支付；</p>
<p>发票类型：日用品、电脑配件、鞋、帽、家电、服装、电脑、ipad、手机、化妆品、食品、其他；</p>
<p>支付金额：货到付款无限制、银行支付不能超出最大限额2万、系统账户余额支付不能超出余额；</p>
<p>订单状态：正在处理、正在送货、处理完成、订单取消。</p>
<p>用正交实验法设计用例。</p>
  
  <p style="margin-top:100px;font-size:20px;">简要分析：</p>
  <p>接口：</p>
  <p>接口包的类型：正常交易包、查询包、退货包、换货包、部分退货包、部分换货包； 共6种情况</p>
  <p>涉及的商品种类：1、2、3、4、5、6；共6种情况</p>
  <p>支付类型：系统账户余额支付、货到付款、工行账户支付、农行账户支付、建行账户支付、交行账户支付、邮储账户支付、礼品卡支付；共8种情况</p>
  <p>发票类型：日用品、电脑配件、鞋、帽、家电、服装、电脑、ipad、手机、化妆品、食品、其他；共12种情况</p>
  <p>支付金额：货到付款无限制、银行支付不能超出最大限额2万、系统账户余额支付不能超出余额；共3种情况</p>
  <p>订单状态：正在处理、正在送货、处理完成、订单取消；共4种情况</p>
  <img src="./1.png"/>
  <p>被测项目中一共有6个被测对象，每个被测对象的状态都不一样。</p>
  <p>产生正交表</p>
  <img src="./2.png"/>
  <img src="./3.png"/>
  <img src="./4.png"/>
  <img src="./5.png"/>
  <img src="./6.png"/>
  <img src="./7.png"/>
  <img src="./8.png"/>
  <img src="./9.png"/>
  <img src="./10.png"/>
  <img src="./11.png"/>
</div>

    </div>



</template>

<script>

export default {
  name: "SalesQuestion",
  components: {},
  props: {},
  data() {
    return { }
  },
  computed: {},
  watch: {},
  created() {},
  mounted() {},
  methods: {

  },
};
</script>

<style scoped lang="less">


</style>